import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';

import '../../Shared/Components/text_style.dart';
import '../../Shared/Constants/constant_strings.dart';

class AboutScreen extends StatelessWidget {
  const AboutScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text(AppStrings.aboutApp),
      ),
      body: SingleChildScrollView(
          padding: EdgeInsets.symmetric(vertical: 16.h, horizontal: 16.w),
          child: Text(
            '''
 هو تطبيق يسمح للمستخدمين بطلب الطعام من المطاعم المحلية. يمكن للمستخدمين البحث عن المطاعم حسب الموقع أو النوع ، وعرض القوائم ، وتقديم الطلبات. يوفر التطبيق أيضًا إمكانية الدفع عبر الإنترنت ، والحصول على العروض الترويجية ، والتقييمات.
المميزات
البحث عن المطاعم حسب الموقع أو النوع
عرض القوائم
تقديم الطلبات
الدفع عبر الإنترنت
الحصول على العروض الترويجية
تقييمات المطاعم
كيفية الاستخدام
قم بتنزيل تطبيق طلب طعام من متجر التطبيقات أو Google Play.
قم بإنشاء حساب أو تسجيل الدخول باستخدام حسابك الحالي.
ابحث عن مطعم في منطقتك.
اختر الطعام الذي تريده من القائمة.
أضف الطعام إلى سلة التسوق.
أدخل تفاصيل التسليم الخاصة بك.
ادفع مقابل طلبك.
انتظر وصول الطعام!
الفوائد
هناك العديد من الفوائد لاستخدام تطبيق طلب طعام ، بما في ذلك:
الراحة: يمكنك طلب الطعام من أي مكان في المنزل أو العمل أو أثناء التنقل.
التنوع: هناك مجموعة واسعة من المطاعم للاختيار من بينها ، حتى تتمكن من العثور على الطعام الذي يلبي ذوقك.
التوفير: يمكنك الحصول على خصومات وعروض ترويجية عند طلب الطعام من خلال التطبيق.
التقييمات: يمكنك قراءة التقييمات من قبل العملاء الآخرين قبل طلب الطعام من مطعم معين.
إذا كنت تبحث عن طريقة مريحة وسهلة لطلب الطعام من المطاعم المحلية ، فإن تطبيق طلب طعام هو الحل الأمثل لك!

للتواصل:
01234567890''',
            style: textStyle(),
          )),
    );
  }
}
